Public Attributes | List of all members
ACAPI::Cutaway::v1::API_CutPolygonInfo Struct Reference
Cutting Plane Management
Information regarding cut polygons. More...
#include <CuttingPlane.hpp>
 Public Attributes
 std::vector< Geometry::MultiPolygon2D >  | cuttingSurfacePolygons
The polygons of the cutting surface.
 double  | area
The size of the cutting polygon.
Detailed Description
Information regarding cut polygons.